{
        "nav-about": "Chi sono",
        "nav-projects": "Progetti", 
        "nav-contacts": "Contatti",
        "hero-eyebrow": "Portfolio Sviluppatore", 
        "hero-name": "Pasha", 
        "hero-btn": "Vedi progetti",
        "hero-tagline": "Sviluppo sistemi di automazione, strumenti Telegram, sistemi web e PC. Costruisco progetti focalizzati su struttura e stabilità.",
        "about-title": 
        "Chi sono", 
        "about-text": "Sono una persona che ritiene importante capire come e perché tutto funziona. Mi interessano i sistemi: tecnici, logici e umani. Non amo il caos e le decisioni casuali, quindi scompongo ogni idea nella sua struttura e la porto a uno stato funzionante e stabile.",
        "about-h-approach": "Approccio", 
        "about-app-1": "Prima l'architettura, poi l'implementazione", 
        "about-app-2": "Analisi dei punti di guasto e scalabilità", 
        "about-app-3": "Un sistema, non una raccolta di funzioni",
        "about-h-prog": "Programmazione", 
        "about-prog-1": "Python, logica asincrona, interfacce web", 
        "about-prog-2": "Automazione, eventi, database", 
        "about-prog-3": "Struttura leggibile e codice estensibile",
        "about-h-tg": "Telegram", 
        "about-tg-1": "Bot come parte di un sistema completo", 
        "about-tg-2": "Bundle: bot + interfaccia web + database", 
        "about-tg-3": "Monitoraggio e controllo in tempo reale",
        "about-h-val": "Valori", 
        "about-val-1": "Onestà e schiettezza", 
        "about-val-2": "Dialogo calmo e professionale", 
        "about-val-3": "Stile curato nel codice e nell'interfaccia",
        "proj-title": "Progetti", 
        "proj-badge": "1 attivo", 
        "proj-name": "Giveaway Bot & Admin Dashboard", 
        "proj-status": "In sviluppo", 
        "proj-more": "Dettagli", 
        "cont-title": "Contatti",
        "cont-note-text": "Se i pulsanti di contatto non funzionano, trovi qui i miei contatti diretti:",
        "cont-note-tg-label": "Telegram:",
        "cont-note-gh-label": "GitHub:",
        "cont-note-mail-label": "Gmail:",
    "pa-back": "← Torna ai progetti",
    "pa-eyebrow": "Caso di studio",
    "pa-tagline": "Sistema integrato di gestione degli account Telegram: pannello di amministrazione web, bot automatizzato, controllo degli accessi e analisi in un unico prodotto.",
    "pa-status": "In sviluppo attivo",
    "pa-concept-title": "Concetto generale",
    "pa-concept-text": "L'obiettivo principale del sistema è automatizzare la partecipazione degli account ai giveaway, garantire l'anonimato degli utenti e fornire all'amministratore il pieno controllo tramite un'interfaccia web. L'architettura è modulare e scalabile: nuove funzionalità possono essere aggiunte senza riscrivere l'intero codice.",
    "pa-users-title": "Utenti e accesso",
    "pa-admin-h": "Per l'amministratore",
    "pa-admin-li1": "Creazione di utenti con ID, nome e username.",
    "pa-admin-li2": "Assegnazione di ruoli, restrizioni e livelli di accesso.",
    "pa-admin-li3": "Collegamento di uno o più account a un utente.",
    "pa-admin-li4": "Controllo completo delle funzionalità del bot.",
    "pa-user-h": "Per l'utente",
    "pa-user-li1": "L'accesso al bot è disponibile solo dopo l'attivazione tramite il sito.",
    "pa-user-li2": "Gestione di più account sotto un unico ID.",
    "pa-user-li3": "Visualizzazione delle statistiche: partecipazione, tasso di successo, attività.",
    "pa-user-li4": "Flusso di lavoro sicuro con codici e password.",
    "pa-bot-title": "Bot Telegram",
    "pa-bot-li1": "Partecipa automaticamente ai giveaway: iscrizioni, captcha, azioni scriptate.",
    "pa-bot-li2": "Monitora l'attività degli account e mostra le statistiche all'utente.",
    "pa-bot-li3": "Sincronizzato con il sito tramite database: le modifiche nel pannello influenzano immediatamente il bot.",
    "pa-bot-li4": "L'elaborazione asincrona consente di gestire più account contemporaneamente.",
    "pa-bot-li5": "Solo gli account attivi e autorizzati partecipano alle campagne.",
    "pa-db-title": "Database e pannello di amministrazione",
    "pa-db-struct-h": "Struttura del database",
    "pa-db-struct-p": "Utenti, account, statistiche e log. Lo stato viene mantenuto dopo il riavvio; sono disponibili analisi ed esportazione.",
    "pa-db-manage-h": "Gestione",
    "pa-db-manage-p": "Aggiunta, modifica ed eliminazione di utenti/account, controllo delle azioni del bot e dei permessi.",
    "pa-db-ui-h": "Interfaccia",
    "pa-db-ui-p": "Tabelle, schede, filtri, visualizzazione dell'attività, effetti hover e navigazione responsive.",
    "pa-sec-title": "Sicurezza e anonimato",
    "pa-sec-li1": "I dati personali sono nascosti e accessibili solo all'amministratore.",
    "pa-sec-li2": "L'accesso agli account è protetto da codici e password.",
    "pa-sec-li3": "Le azioni del bot e dell'amministratore vengono registrate senza divulgare informazioni private.",
    "pa-sec-li4": "L'architettura modulare riduce il rischio di errori e vulnerabilità.",
    "pa-adv-title": "Vantaggi principali",
    "pa-adv-li1": "Gestione centralizzata di utenti e account.",
    "pa-adv-li2": "Automazione della partecipazione ai giveaway senza attività manuali ripetitive.",
    "pa-adv-li3": "Analisi dettagliate per account e utenti.",
    "pa-adv-li4": "Sicurezza, anonimato e gestione trasparente.",
    "pa-adv-li5": "Facile espansione e integrazione di nuovi moduli.",
    "pa-stack-title": "Stack tecnologico",
    "pa-stack-py": "Logica del bot ed elaborazione lato server",
    "pa-stack-tg": "Interazione con gli utenti",
    "pa-stack-web": "Interfaccia web e UX",
    "pa-stack-db": "Archiviazione di utenti e statistiche",
    "pa-stack-async": "Elaborazione asincrona di più account",
    "pa-gallery-title": "Galleria visiva",
    "pa-gal-cap1": "Dashboard amministratore: accessi, ruoli, controllo delle azioni.",
    "pa-gal-cap2": "Percorso utente: interazione su Telegram e scenari di partecipazione.",
    "pa-gal-cap3": "Infrastruttura: stabilità, archiviazione dei dati e scalabilità.",
    "pa-res-title": "Risultato",
    "pa-res-text": "Non è solo un bot, ma un sistema completo: ogni azione è sotto controllo, ogni account è protetto e l'amministratore vede il quadro completo in tempo reale. La soluzione è adatta per automazione scalabile, sviluppo modulare e gestione trasparente degli account Telegram."
}